Repository: SBEGIM/LUNA-market
Catalog: lib/src/core/constant/localization/translations/intl_*.arb
Languages: kk, ru

# abstract
source: Synopsis
kk: Конспект
ru: Конспект

# achivements
source: Achievements
kk: Жетістіктер
ru: Достижения

source: Add child
kk: Бала қосу
ru: Добавить ребенка

# additionally
source: Additional
kk: Толығырақ
ru: Дополнительно

# allClassesCompleted
source: All lessons completed
kk: Барлық сабақтар аяқталды
ru: Все занятия пройдены

# allItemsAreBySubscription
source: My subjects
kk: Менің пәндерім
ru: Мои предметы

# areSureWantDeleteYourAccount
source: Are you sure you want to delete the account?
kk: Аккаунтты шынымен өшіргіңіз келе ме?
ru: Вы точно хотите удалить аккаунт?

# areSureWantOutYourAccount
source: Are you sure you want to log out?
kk: Аккаунттан шынымен шыққыңыз келе ме?
ru: Вы точно хотите выйти из аккаунта?

# assessmentSystem
source: Grading system
kk: Бағалау жүйесі
ru: Система оценивания

source: attempt
kk: мүмкіндік
ru: попытка

# attemptNumberN
source: Attempt №{value}
kk: №{value} мүмкіндік
ru: Попытка №{value}

source: Attention
kk: Назар аударыңыз
ru: Внимание

source: Back
kk: Артқа
ru: Назад

source: Cancel
kk: Бас тарту
ru: Отменить

# challengYourselYourRivalsIntellectualBattle
source: Challenge yourself or opponents to an intellectual battle
kk: Өзіңізді немесе қарсыластарды интеллектуалды сайысына шақырыңыз
ru: Вызови себя или соперников на интеллектуальный бой

# changeThePassword
source: Change password
kk: Құпия сөзді өзгерту
ru: Изменить пароль

# changeThePhoneNumber
source: Change phone number
kk: Телефон нөмірін өзгерту
ru: Изменить номер телефона

source: Chat
kk: Чат
ru: Чат

# checkConnectionRetry
source: Please check your connection and try again.
kk: Қосылымды тексеріп, қайталап көріңіз.
ru: Пожалуйста, проверьте соединение и повторите попытку.

# checkConnectionYourWiFSonyaPhoneTryAgain
source: Check your Wi-Fi or mobile phone connection and try again
kk: Wi-Fi немесе ұляы телефоныңыздың қосылымын тексеріп, әрекетті қайталаңыз
ru: Проверьте подключение к Wi-Fi или мобильной сети и попробуйте снова

# checkYourInternetConnectionTryAgainLater
source: Check internet connection and try again later
kk: Интернет байланысын тексеріп, кейінірек қайталап көріңіз
ru: Проверьте подключение к интернету и повторите попытку

# checkoup
source: Checkup
kk: Чекап
ru: Чекап

source: Checkup progress
kk: Чекаптардың прогресі
ru: Прогресс чекапов

source: Choose
kk: Рөлді
ru: Выберите

source: Choose another photo
kk: Басқа фото таңдау
ru: Выбрать другое фото

# chooseAppropriateRoleForRegistration
source: Select the appropriate role for registration
kk: Сізге сәйкес келетін рөлді таңдаңыз
ru: Выберите подходящую роль для регистрации

# chooseCourse
source: Choose a suitable course
kk: Өзіңізге сәйкес курсты таңдаңыз
ru: Выберите подходящий для себя курс

source: Choosed
kk: Таңдалған
ru: Выбрано

source: City
kk: Қала
ru: Город

# classes
source: Class
kk: Сынып
ru: Класс

source: Classes not found
kk: Сыныптар табылмады
ru: Классы не найдены

# comeApWithNewPassword
source: Create a new password
kk: Жаңа құпия сөз ойлап табыңыз
ru: Придумайте новый пароль

# completeCheckup
source: Complete the checkup and find out what you have learned in the last two weeks
kk: Чекаптан өтіп, соңғы екі аптада не меңгергеніңізді біліңіз
ru: Пройдите чекап и узнайте, что вы освоили за последние две недели

# completeClassesTakeTestIntoTheMonthlyRanking
source: Complete the lessons and take the test to enter the monthly ranking
kk: Айлық рейтингке қосылу үшін сабақ өтіп, тесті тапсырыңыз
ru: Пройдите занятия и сдайте тест, чтобы попасть в ежемесячный рейтинг

# confirmFinishErrorCorrection
source: Are you sure you want to finish error correction?
kk: Қателермен жұмысты аяқтағыңыз келетініне сенімдісіз бе?
ru: Вы уверены, что хотите завершить работу над ошибками?

# confirmYes
source: Yes, I’m sure
kk: Иә, сенімдімін
ru: Да, уверен

# continueGameJoinNewOne
source: Continue the game or join a new one
kk: Ойынды жалғастырыңыз немесе жаңа ойын бастаңыз
ru: Продолжи игру или присоединись к новой

# continueLabel
source: Continue
kk: Жалғастыру
ru: Продолжить

source: Continue Test
kk: Тесті жалғастыру
ru: Продолжить тест

source: Correct
kk: Дұрыс
ru: Правильно

source: Create an account
kk: Тіркелу
ru: Создать аккаунт

source: Current games
kk: Ағымдағы ойындар
ru: Текущие игры

# currentResultSaved
source: The current result will be saved. You can continue from this point next time.
kk: Ағымдағы нәтиже сақталады. Келесі жолы осы жерден жалғастыра аласыз.
ru: Текущий результат сохранится. Вы сможете продолжить с этого места в следующий раз

# currentResultsNotSaved
source: Your current results will not be saved
kk: Ағымдағы нәтижелеріңіз сақталмайды
ru: Ваши текущие результаты не сохранятся

source: Custom Colors
kk: Арнайы түстер
ru: Пользовательские цвета

source: Daily
kk: Күндік
ru: Дневное

source: Date
kk: Күн
ru: Дата

source: Default Themes
kk: Негізгі темалар
ru: Темы по умолчанию

source: Delete account
kk: Аккаунтты жою
ru: Удалить аккаунт

source: Delete child
kk: Баланы тізімнен жою
ru: Удалить ребенка

source: Delete photo
kk: Фотоны жою
ru: Удалить фото

# deletingAccount
source: Account deletion
kk: Аккаунтты жою
ru: Удаление аккаунта

source: Description
kk: Сипаттама
ru: Описание

# didnGetCode
source: Didn't get the code?
kk: Код келмеді ме?
ru: Не получили код?

# discountForFirstMonth
source: Sign up today and get a 5% discount on the first month
kk: бірінші айға 5% жеңілдік алыңыз!
ru: скидку 5% на первый месяц!

# donYouHaveAccount
source: Don't you have an account?
kk: Сізде аккаунт жоқ па?
ru: У вас нет аккаунта?

# eachSubjectRequiredStudiedTimesWeek
source: Each subject is mandatory to study twice a week
kk: Әр пән аптасына 2 рет оқылуы керек
ru: Каждый предмет обязателен к изучению 2 раза в неделю

source: Edit profile
kk: Профильді өңдеу
ru: Редактировать профиль

# emptyHere
source: It's empty here for now
kk: Әзірге ақпарат жоқ
ru: Тут пока пусто

# enter
source: Login
kk: Кіру
ru: Войти

# enterCodeFromSMS
source: Enter the code from the SMS
kk: SMS - тен кодты енгізіңіз
ru: Введите код из SMS

# enterDetailsLogToYourAccount
source: Enter your details to log in to your account
kk: Кіру үшін деректерді енгізіңіз
ru: Введите данные, чтобы войти в аккаунт

# enterName
source: Enter a name
kk: Атыңызды енгізіңіз
ru: Введите имя

# enterTheDetailsToRegister
source: Enter your details to register
kk: Тіркелу үшін деректерді толтырыңыз
ru: Введите данные, чтобы зарегистрироваться

source: Enter the old password
kk: Ескі құпия сөзді енгізіңіз
ru: Введите старый пароль

source: Enter the password
kk: Құпия сөзді енгізіңіз
ru: Введите пароль

# enterTopStudentsMonthReceiveGifts
source: Enter the top 3 students of the month and receive gifts.
kk: Айдың үздік 3 оқушысы қатарына кіріп, сыйлықтар ұтып алыңыз
ru: Войди в топ-3 учеников месяца и получай подарки

source: Enter your child's phone
kk: Балаңыздың нөмірін енгізіңіз
ru: Введите номер вашего ребенка

source: Enter your last name
kk: Фамилияны енгізіңіз
ru: Введите фамилию

# enterYourPhoneNumber
source: Enter the phone number
kk: Телефон нөмірін енгізіңіз
ru: Введите номер телефона

source: Error correction
kk: Қателермен жұмыс
ru: Работа над ошибками

source: Exit
kk: Шығу
ru: Выйти

# exitNotes
source: Exit the notes?
kk: Конспекттен шығасыз ба?
ru: Выйти из конспекта?

# exitTest
source: Exit the test?
kk: Тесттен шығасыз ба?
ru: Выйти из теста?

# expected
source: Awaited
kk: Күтілуде
ru: В ожидании

source: Feedback
kk: Кері байланыс
ru: Обратная связь

# findFriend
source: Find a friend
kk: Дос табу
ru: Найти друга

# findFriendsPlayWithThem
source: Find friends and play together with them
kk: Достарыңды тауып, бірге ойна
ru: Находи друзей и играй вместе с ними

# findOutHowEarnPoints
source: Find out how to earn points
kk: Балл қалай есептелетінін біліңіз
ru: Узнайте, как заработать баллы

source: Finish test
kk: Тестті аяқтау
ru: Завершить тест

# firstCheckupAvailableAfterWeeks
source: Your first checkup will be available when you complete 1-2 weeks of subject lessons
kk: Сіздің алғашқы чекапыңыз 1-2 апталық пән сабақтарын өткеннен кейін қолжетімді болады
ru: Ваш первый чекап будет доступен, когда вы пройдете 1-2 недели занятий по предметам

# forSpecifyingCityWhichYouLiveProfile
source: For filling in your city in the profile
kk: Профильде қалаңызды көрсеткен үшін
ru: За указание в профиле города в котором вы живете

source: Forgot your password?
kk: Құпия сөзді ұмыттыңыз ба?
ru: Забыли пароль?

source: Free consultation
kk: Тегін консультация
ru: Бесплатная консультация

# gOover
source: Open
kk: Ашу
ru: Перейти

source: General
kk: Жалпы
ru: Общее

# getFreeConsultationAboutCourses
source: Get a free consultation about our courses
kk: Біздің курстарымыз туралы тегін консультация алыңыз
ru: Получите бесплатную консультацию о наших курсах

source: Get it again
kk: Қайтадан жіберу
ru: Получить еще раз

# goTasks
source: Go to tasks
kk: Тапсырмаларға өту
ru: Перейти к заданиям

# goodness
source: Welcome
kk: Қош
ru: Добро

# haveTimeCcompleteTasksBefore
source: Complete the tasks before 23:59
kk: Тапсырмаларды 23:59-ға дейін орындап үлгеріңіз
ru: Успейте выполнить задания до 23:59

source: Hello
kk: Сәлем
ru: Привет

source: In the settings, you need to provide access to the photo
kk: Баптауда фотосуреттерге рұқсат беру керек
ru: В настройках вам нужно предоставить доступ к фотографии

source: Incorrect
kk: Дұрыс емес
ru: Неправильно

source: Incorrect email format
kk: Электрондық поштаның қате форматы
ru: Неверный формат электронной почты

# incorrectNumberFormat
source: Invalid number format
kk: Телефон нөмірінің форматы қате
ru: Неверный формат номера

source: Invalid link format
kk: Сілтеменің жарамсыз форматы
ru: Неверный формат ссылки

source: Invalid number format
kk: Сандардың жарамсыз форматы
ru: Неверный формат номера

# itemLocked
source: This item is locked.
kk: Бұл элемент құлыптаулы.
ru: Этот элемент заблокирован.

source: Language
kk: Тіл
ru: Язык

source: Lesson
kk: Сабақ
ru: Урок

# lessonClarity
source: How clear was the lesson?
kk: Сабақ қаншалықты түсінікті болды?
ru: На сколько был понятным урок?

source: Lesson details
kk: Сабақ мәліметтері
ru: Детали урока

# lessonLimitReached
source: You have reached the lesson limit for today. Come back tomorrow to continue learning!
kk: Бүгінгі сабақтар лимитіне жеттіңіз. Оқуды жалғастыру үшін ертең қайта оралыңыз!
ru: Вы достигли лимита уроков на сегодня. Возвращайтесь завтра, чтобы продолжить обучение!

source: Lesson number and topic
kk: Сабақ № және тақырыбы
ru: № урока и тема

source: Lesson test
kk: Сабақ бойынша тест
ru: Тест по уроку

source: Let us complete today's tasks
kk: Бүгінгі тапсырмаларды орындайық
ru: Давай выполним сегодняшние задачи

# listStudents
source: List of students
kk: Оқушылар тізімі
ru: Список учеников

source: Locales
kk: Локализация
ru: Локализация

# main
source: Home
kk: Басты бет
ru: Главная

# makeSureYourChild
source: Make sure this is your child
kk: Сіздің балаңыз екеніне көз жеткізіңіз
ru: Убедитесь, что это ваш ребенок

# message
source: Messages
kk: Хабарламалар
ru: Сообщения

# moreDetailed
source: More details
kk: Толығырақ
ru: Подробнее

# myChildren
source: My child
kk: Менің балам
ru: Мой ребенок

source: My data
kk: Менің деректерім
ru: Мои данные

source: My friends
kk: Менің достарым
ru: Мои друзья

source: My profile
kk: Профиль
ru: Мой профиль

source: My progress
kk: Менің нәтижелерім
ru: Мой прогресс

source: My subscriptions
kk: Менің жазылымдарым
ru: Мои подписки

# nWords
source: words
kk: сөз
ru: слов

source: Name
kk: Аты
ru: Имя

# news
source: Новости
kk: Жаңалықтар

source: Next
kk: Әрі қарай
ru: Дальше

source: No
kk: Жоқ
ru: Нет

# noCheckupsYet
source: No checkups yet, but don’t worry — they will appear soon. Stay tuned for updates!
kk: Әзірге чекаптар жоқ, бірақ уайымдамаңыз — олар жақында пайда болады. Жаңартуларды қадағалаңыз!
ru: Чекапов пока нет, но не переживайте — они скоро появятся. Следите за обновлениями!

source: No internet connection
kk: Интернет байланысы жоқ
ru: Нет интернет соединения

source: No messages yet
kk: Хабарлама жоқ
ru: Пока нет уведомлений

# notAvailableYet2Lines
source: Not available yet
kk: Әзірге қолжетімсіз
ru: Пока недоступен

source: Not completed
kk: Өтілмеген
ru: Не пройден

source: Not Passed
kk: Тапсырылмаған
ru: Не сдан

source: Not viewed
kk: Көрілмеген
ru: Не просмотрен

source: Notes sent
kk: Конспект жіберілді
ru: Конспект отправлен

# notesSuccessfullySent
source: Your notes have been successfully sent. Thank you for your work! Wait for a response from the curator.
kk: Сіздің конспектіңіз сәтті жіберілді. Куратор жақын арада жұмысыңызды тексереді.
ru: Ваш конспект успешно отправлен. Куратор скоро проверит вашу работу.

# nothingWasFoundYourSearchChangeSearchDataTryAgain
source: Nothing found for your query. Try changing the search data and try again
kk: Сұрауыңыз бойынша ештеңе таппадық. Іздеу деректерін өзгертіп көріңіз
ru: По вашему запросу ничего не найдено. Попробуйте изменить данные поиска и повторите попытку

source: Notifications
kk: Хабарламалар
ru: Уведомления

source: Old password
kk: Ескі құпия сөз
ru: Старый пароль

source: Open
kk: Ашу
ru: Открыть

# openSummary
source: Open the notes
kk: Конспекті ашу
ru: Открыть конспект

source: Open WhatsApp
kk: WhatsApp-ты ашу
ru: Открыть WhatsApp

source: Parent
kk: Ата-ана
ru: Родитель

# pass
source: Start
kk: Өту
ru: Пройти

# passed
source: Completed
kk: Өтті
ru: Пройдено

source: Password
kk: Құпия сөз
ru: Пароль

source: Password Recovery
kk: Құпия сөзді қалпына келтіру
ru: Восстановление пароля

# passwordsDonMatch
source: Passwords don't match
kk: Құпия сөздер сәйкес келмейді
ru: Пароли не совпадают

source: Phone number
kk: Телефон нөмірі
ru: Номер телефона

source: Phone number confirmation
kk: Телефон нөмірін растау
ru: Подтверждение номера телефона

source: Play
kk: Ойнау
ru: Играть

source: points
kk: балл
ru: балл

# pointsPlural
source: {value} points
kk: {value} балл
ru: {value, plural, =1{1 балл} other{{value} баллов}}

source: Practical tests
kk: Практикалық тест
ru: Практические тесты

# professionalTeamDescription
source: We are a team of professionals who turn the admission process into a simple and clear journey
kk: Біз – қабылдау процесін қарапайым және түсінікті жолға айналдыратын мамандар командасымыз
ru: Мы – команда профессионалов, которая превращает процесс поступления в простой и понятный путь

source: Profile
kk: Профиль
ru: Профиль

source: profile error
kk: профильде қате
ru: ошибка профиля

source: Pull down to refresh
kk: Жаңарту үшін, төмен қарай тартыңыз
ru: Потяните вниз, чтобы обновить

source: Pull up to load the data
kk: Деректерді жүктеу үшін жоғары қарай тартыңыз
ru: Потяните вверх, чтобы загрузить данные

# questionXFromN
source: Question {value} of {value1}
kk: {value}/{value1} сұрақ
ru: Вопрос {value} из {value1}

# rateSummary
source: Rate the notes
kk: Конспекті бағалау
ru: Оценить конспект

source: Rating
kk: Рейтинг
ru: Рейтинг

# ratingEmpty
source: The rating is empty for now
kk: Рейтинг әзірге бос
ru: Пока рейтинг пуст

# ratingTheMonth
source: Rating of the month
kk: Айлық рейтинг
ru: Рейтинг месяца

source: Read the comment
kk: Пікірді оқу
ru: Прочитать комментарий

source: Register
kk: Тіркелу
ru: Зарегистрироваться

# repeatThePassword
source: Repeat password
kk: Құпия сөзді қайталаңыз
ru: Повторите пароль

source: Report
kk: Есептеме
ru: Отчет

# requiredFillIn
source: Required to fill
kk: Міндетті түрде толтыру
ru: Обязательно к заполнению

# resetPassword
source: Reset your password
kk: Жалғастыру
ru: Сбросить пароль

source: Retake test
kk: Тестті қайта тапсыру
ru: Сдать повторно

source: role
kk: таңдаңыз
ru: роль

source: Save
kk: Сақтау
ru: Сохранить

source: Saved
kk: Сақталды
ru: Сохранено

source: Search
kk: Іздеу
ru: Поиск

# selectChildAccount
source: Choose the child's account
kk: Баланың аккаунтын таңдаңыз
ru: Выберите аккаунт ребенка

# selectDate
source: Choose the date
kk: Күнді таңдаңыз
ru: Выберите дату

source: Send
kk: Жіберу
ru: Отправить

source: Show all
kk: Барлығын көрсету
ru: Показать все

source: Show more
kk: Көбірек көрсету
ru: Показать еще

# signTodayGet
source: Sign up today and get a 5% discount on the first month
kk: Бүгін курсқа тіркеліп,
ru: Запишись сегодня и получи

# signUp
source: Register
kk: Тіркелу
ru: Записаться

source: Something is wrong
kk: Қателік орын алды
ru: Что-то пошло не так

# specifyYourCity
source: Enter your city
kk: Қалаңызды көрсетіңіз
ru: Укажите свой город

# specifyYourClass
source: Enter your class
kk: Сыныбыңызды көрсетіңіз
ru: Укажите свой класс

source: Start
kk: Бастау
ru: Начать

source: Start learning
kk: Оқуды бастау
ru: Начать обучение

# startNewGame
source: Start a new game'
kk: Жаңа ойын бастау'
ru: Начать новую игру'

source: Start test
kk: Тестті бастау
ru: Начать тест

source: Stay
kk: Қалу
ru: Остаться

source: student
kk: оқушы
ru: студент

source: Student testimonials
kk: Біздің оқушылардың пікірлері
ru: Отзывы наших учеников

# studentWithCapitalLetter
source: Student
kk: Оқушы
ru: Ученик

source: Study Line benefits
kk: Study Line артықшылықтары
ru: Преимущества Study Line

source: Study Line Support
kk: Study Line қолдау қызметі
ru: Поддержка Study Line

source: Subject
kk: Пән
ru: Предмет

# submitRequestForFreeConsultation
source: Submit a request for a free consultation!
kk: Тегін кеңес алу үшін өтінім қалдырыңыз!
ru: Оставьте заявку для получения бесплатной консультации!

# successfullyCompletedTasks
source: You successfully completed today's tasks
kk: Сіз бүгінгі тапсырмаларды сәтті аяқтадыңыз
ru: Ты успешно прошел сегодняшние задания

source: Successfully updated!
kk: Сәтті жаңартылды!
ru: Успешно обновлено!

source: Surname
kk: Фамилия
ru: Фамилия

# tasksForToday
source: Assignments for today
kk: Бүгінгі тапсырмалар
ru: Задания на сегодня

source: Test
kk: Тест
ru: Тест

# theChildWithNumberWasFound
source: No child found with this number
kk: Осы нөмірмен тіркелген бала жоқ
ru: Ребенок с таким номером не найден

# theCityHero
source: City hero
kk: Қалалық батыр
ru: Городской герой

source: The city is not specified
kk: Қала көрсетілмеген
ru: Город не указан

# theCommaMustBeLeastCharactersLong
source: The comment must be at least 10 characters long
kk: Пікір кемінде 10 таңбадан тұруы керек
ru: Комментарий должен содержать минимум 10 символов

# theCommentBeenSent
source: Comment sent!
kk: Пікір жіберілді!
ru: Комментарий отправлен!

# theCurrentVersionTheApplicationInvalid
source: The current version of the app is invalid
kk: Қосымшаны ағымдағы нұсқасы жарамсыз
ru: Текущая версия приложения устарела

# theMessageHasBeenSent
source: Message sent!
kk: Хабарлама жіберілді!
ru: Сообщение отправлено!

# theMinimumPasswordLength
source: The password must contain at least 4 characters
kk: Құпия сөз кемінде 4 таңбадан тұруы керек
ru: Пароль должен содержать не менее 4 символов

# theMinimumPasswordLengthIs4
source: The password must contain at least 4 characters
kk: Құпия сөз кемінде 4 таңбадан тұруы керек
ru: Пароль должен содержать не менее 4 символов

source: The service is temporarily unavailable
kk: Сервис уақытша қолжетімсіз
ru: Сервис временно недоступен

# thereAreJobsCheckWaitStudentsSubmitAssignments
source: No work to check. Please wait for students to submit their assignments
kk: Тексеруге жұмыс жоқ. Оқушылар тапсырмаларын жібергенше күтіңіз
ru: Нет работ для проверки.Ожидайте, когда ученики отправят задания

# thereAreMessagesSoonTheyArriveWillThemHere
source: There are no messages yet
kk: Әзірге хабарламалар жоқ
ru: Сообщений пока нет. Как только они поступят, вы увидите их здесь

# thereJobsCheckWaitStudentsSubmitAssignments
source: No work to check. Please wait for students to submit their assignments
kk: Тексеруге жұмыс жоқ. Оқушылар тапсырмаларын жібергенше күтіңіз
ru: Нет работ для проверки.Ожидайте, когда ученики отправят задания

# thereNotificationYet
source: No notifications yet
kk: Хабарлама жоқ
ru: Пока нет уведомлений

# thereStudentsYetSoonTheyArriveWillSeeThemHere
source: The students list is empty
kk: Тізімде оқушылар жоқ
ru: Список учеников пуст

# thereYetButWorAippearSoonStayTuned
source: There are no updates yet, but don’t worry — they’ll be available soon. Stay tuned for updates!
kk: Әзірше жаңалықтар жоқ, бірақ уайымдамаңыз — олар жақында пайда болады. Жаңартуларды бақылаңыз!
ru: Новостей пока нет , но не переживайте — они скоро появятся. Следите за обновлениями!

# thisProcessWorksPleaseAgainLater
source: We are already working on resolving the issue, please try again later
kk: Бұл процесс жұмыс үстінде, өтінеміз, кейінірек қайталап көріңіз
ru: Мы уже работаем над устранением проблемы, повторите попытку позднее

# thisSectionIsUnderDevelopment
source: Section is under development
kk: Бөлім әзірленуде
ru: Раздел в разработке

# toConfirmNumberWeHaveSentCodeNumber
source: To confirm your number, we have sent a code to the number:
kk: Нөміріңізді растау үшін біз кодты келесі нөмірге жібердік:
ru: Для подтверждения вашего номера, мы отправили код на номер:

source: To receive reports, add your child to the system
kk: Есептерді алу үшін балаңызды жүйеге қосыңыз
ru: Для получения отчетов добавьте ребенка в систему

# toShare
source: Share
kk: Бөлісу
ru: Поделиться

source: Today
kk: Бүгін
ru: Cегодня

source: Topic
kk: Тақырып
ru: Тема

# tutor
source: Curator
kk: Куратор
ru: Куратор

source: Unknown error
kk: Белгісіз қате
ru: Неизвестная ошибка

source: Update!
kk: Жаңарту!
ru: Обновить!

# updateDotDotDot
source: Updating...
kk: Жаңартылуда...
ru: Обновление...

# updateTheApplication
source: Update the app
kk: Қосымшаны жаңартыңыз
ru: Обновите приложение

# uploadingDotDotDot
source: Loading...
kk: Жүктелуде...
ru: Загружаем...

# verySoonWillAppearInTheApplicationAndYouWillAbleCheck
source: The
kk: Жақын арада
ru: В ближайшее время раздел

source: Video
kk: Бейне
ru: Видео

source: Video explanation
kk: Бейне түсіндірме
ru: Видео объяснение

source: Video lesson
kk: Бейне сабақ
ru: Видео урок

# viewTheReport
source: View report
kk: Отчетты қарау
ru: Посмотреть отчет

source: Viewed
kk: Қаралған
ru: Просмотрено

# warningTextNotSaved
source: Attention! Your text will not be saved
kk: Назар аударыңыз! Сіздің мәтініңіз сақталмайды
ru: Внимание! Ваш текст не сохранится

# watch
source: Open
kk: Толығырақ
ru: Посмотреть

source: Weak internet connection
kk: Интернет байланысы әлсіз
ru: Интернет байланысы әлсіз

source: Weekly
kk: Апталық
ru: Недельное

source: Welcome
kk: Қош келдіңіз!
ru: пожаловать!

source: Welcome back!
kk: Қош келдіңіз!
ru: возвращением!

source: Well done
kk: Жарайсың
ru: Молодец

# whatIncludedTheSubscription
source: Included in the subscription
kk: Жазылымға кіреді
ru: Что входит в подписку

# willAppearSoonStayTuned
source: No lessons yet, but don't worry — they will be available soon. Stay tuned for updates!
kk: Әзірге сабақтар жоқ, бірақ уайымдамаңыз — олар жақында қолжетімді болады. Жаңартуларды бақылаңыз!
ru: Уроков пока нет , но не переживайте — они скоро появятся. Следите за обновлениями!

# workVerification
source: Work review
kk: Жұмыстарды тексеру
ru: Проверка работ

source: Write
kk: Жазу
ru: Написать

# writeAllStudents
source: Write to all students
kk: Барлық оқушыларға жазу
ru: Написать всем ученикам

# writeCommentStudentAboutWork
source: Write a comment to the student about their work...
kk: Оқушының жұмысы туралы пікір жазыңыз...
ru: Напишите комментарий ученику по его работе..

# writeLeastWords
source: Write at least 10 words
kk: Кем дегенде 10 сөз жазыңыз
ru: Напишите минимум 10 слов

# writeMessage
source: Write a message
kk: Хабарлама жазыңыз
ru: Напишите сообщение

# writeMessageStudents
source: Write a message that will be sent to all your students
kk: Барлық оқушыларыңызға жіберілетін хабарламаны жазыңыз
ru: Напишите сообщение, которое будет отправлено всем вашим ученикам
