Repository: SBEGIM/LUNA-market
Catalog: lib/src/core/constant/localization/translations/intl_*.arb
Languages: kk, ru

# writeWhatYouLearnedInTheLessonDots
source: Write what you learned in the lesson...
kk: Сабақта не үйренгенінді жаз...
ru: Сегодня я узнал....

# writeWordSummary
source: Write a summary of 30 words to earn 30 points. For 20 points – 20 words. And for 10 words, you will get 10 points
kk: 30 балл алу үшін 30 сөзден тұратын конспект жазыңыз. 20 балл үшін – 20 сөз. Ал 10 сөз үшін 10 балл аласыз
ru: Напишите конспект из 30 слов для получения 30 баллов. Для 20 баллов – 20 слов. А за 10 слов вы получите 10 баллов

# xOutOfNLessonsCompleted
source: {value} out of {value1} lessons completed
kk: {value}/{value1} сабақ аяқталды
ru: {value} из {value1} занятий пройдено

source: Yes, add
kk: Иә, қосу
ru: Да, добавить

source: Yes, delete
kk: Иә, жою
ru: Да, удалить

# yesWill
source: Yes, exit
kk: Иә, шығу
ru: Да, выйти

source: Yesterday
kk: Кеше
ru: Вчера

# youHaveAttemptsPassTheTest
source: You have {value} attempts to pass the test
kk: Сізде тест тапсыруға {value} мүмкіндік бар
ru: У вас есть {value, plural, =1{1 попытка} other{{value} попытки}}, чтобы сдать тест

# youMustSpecifyCity
source: You need to specify the city
kk: Қаланы көрсету қажет
ru: Необходимо указать город

# youMustSpecifyClass
source: You need to specify the class
kk: Сыныпты көрсету қажет
ru: Необходимо указать класс

source: You scored
kk: Сіз жинадыңыз
ru: Вы набрали

source: Your manager
kk: Сіздің менеджеріңіз
ru: Ваш менеджер

# yourProgressSavedContinueTheTestToCompleteIt
source: Your progress has been saved. Continue the test to complete it.
kk: Тесті жалғастырыңыз, сіздің прогрессіңіз сақталды.
ru: Ваш прогресс сохранён. Продолжите тест, чтобы завершить его.

# whatsappInitialText
source: Сәлеметсіз бе! Сіздердің курстарыңыз туралы ақпарат алғым келеді...
ru: Здравствуйте! Меня интересует ваш курс…
