import 'package:flutter/material.dart';
import 'package:flutter_html/flutter_html.dart';

class Politic extends StatefulWidget {
  const Politic({Key? key}) : super(key: key);

  @override
  _PoliticState createState() => _PoliticState();
}

class _PoliticState extends State<Politic> {
  final htmlData = r"""
<p>Политика конфиденциальности &laquo;LUNA market&raquo;&nbsp;</p>
<p>Редакция №__ от &ldquo;__&rdquo;_____ 20__г.</p>
<p><br></p>
<p>Это Политика конфиденциальности &laquo;LUNA market&raquo;&nbsp;(далее - Политика).</p>
<p>В Политике мы обращаемся к вам как пользователям нашего мобильного приложения &laquo;LUNA market&raquo;&nbsp;(далее - Маркетплейс).</p>
<p>Когда в Политике используются слова &laquo;мы&raquo;, &laquo;нас&raquo; и прочие, говорится о владельце Маркетплейса &mdash; Хаджиеве Мовсади Ахмедовиче.</p>
<p><br></p>
<h1>О чем эта Политика</h1>
<p>В Политике изложена информация о том, как мы обрабатываем ваши персональные данные и обеспечиваем их безопасность и конфиденциальность.</p>
<p>Из Политики вы узнаете, какие персональные данные мы получаем и как их используем.</p>
<h1>Что такое персональные данные</h1>
<p>Персональные данные &ndash; это любая информация о человеке (субъекте персональных данных), по которым можно его определить.</p>
<p>Мы обрабатываем только те персональные данные, которые перечислены в Политике, и которые характеризуют вас как пользователя Маркетплейса.</p>
<p>Вы можете дать согласие на обработку персональных данных при заполнении форм обратной связи Маркетплейса и иными способами, предусмотренными Политикой.</p>
<p>Вы вправе не указывать персональные данные, если являетесь представителем юридического лица. В таком случае вы можете указать корпоративную электронную почту, рабочий номер телефона или адрес работодателя.</p>
<h1>Какие права есть у вас</h1>
<p>В любой момент, когда у нас есть ваши персональные данные, вы можете воспользоваться следующими правами:</p>
<div align="left">
    <table>
        <tbody>
            <tr>
                <td>
                    <p>Право на доступ</p>
                </td>
                <td>
                    <p>У вас есть право запросить копию персональных данных, которые у нас есть</p>
                </td>
            </tr>
            <tr>
                <td>
                    <p>Право на исправление</p>
                </td>
                <td>
                    <p>Вы можете попросить нас исправить неточные или неполные персональные данные</p>
                </td>
            </tr>
            <tr>
                <td>
                    <p>Право на отзыв</p>
                </td>
                <td>
                    <p>В любой момент вы можете отозвать свое согласие на обработку данных</p>
                </td>
            </tr>
            <tr>
                <td>
                    <p>Право на забвение</p>
                </td>
                <td>
                    <p>Вы можете запросить удаление данных, которые у нас есть относительно вас, за исключением случаев, когда мы обязаны хранить эти данные по закону</p>
                </td>
            </tr>
        </tbody>
    </table>
</div>
<p>Вы можете обратиться к нам, если захотите уточнить порядок реализации иных прав, предусмотренных федеральным законом &laquo;О персональных данных&raquo;.&nbsp;</p>
<h1>Как мы обрабатываем персональные данные</h1>
<p>Мы обрабатываем персональные данные как в цифровой форме (автоматизировано), так и вручную (без использования средств автоматизации). При этом мы ограничиваемся следующими действиями:</p>
<ul>
    <li>
        <p>сбор</p>
    </li>
    <li>
        <p>систематизация</p>
    </li>
    <li>
        <p>накопление</p>
    </li>
    <li>
        <p>хранение</p>
    </li>
    <li>
        <p>уточнение (обновление, изменение)</p>
    </li>
    <li>
        <p>обезличивание</p>
    </li>
    <li>
        <p>уничтожение персональных данных</p>
    </li>
</ul>
<h1>В каких целях мы обрабатываем ваши персональные данные</h1>
<div align="left">
    <table>
        <tbody>
            <tr>
                <td>
                    <p>Цель</p>
                </td>
                <td>
                    <p>Персональные данные</p>
                </td>
                <td>
                    <p>Категория</p>
                </td>
                <td>
                    <p>Срок обработки</p>
                </td>
                <td>
                    <p>Порядок уничтожения&nbsp;</p>
                </td>
            </tr>
            <tr>
                <td>
                    <p>Обеспечение качественной работы Маркетплейса</p>
                </td>
                <td>
                    <p>cookie-файлы</p>
                </td>
                <td>
                    <p>общие</p>
                </td>
                <td>
                    <p>до отзыва согласия на обработку или удаления Профиля</p>
                </td>
                <td>
                    <p>удаление из нашей базы данных</p>
                </td>
            </tr>
            <tr>
                <td>
                    <p>Авторизация и получение доступа к Профилю в соответствии с Пользовательским соглашением</p>
                </td>
                <td>
                    <p>Имя, номер телефона, адрес эл. почты</p>
                </td>
                <td>
                    <p>общие</p>
                </td>
                <td>
                    <p>до отзыва согласия на обработку или удаления Профиля</p>
                </td>
                <td>
                    <p>удаление из нашей базы данных</p>
                </td>
            </tr>
            <tr>
                <td>
                    <p>Доставка товара, если она осуществляется по адресу физического лица</p>
                </td>
                <td>
                    <p>ФИО, номер телефона, адрес доставки</p>
                </td>
                <td>
                    <p>общие</p>
                </td>
                <td>
                    <p>до исполнения обязательства по передаче товара</p>
                </td>
                <td>
                    <p>удаление из нашей базы данных</p>
                </td>
            </tr>
            <tr>
                <td>
                    <p>Направление информации о статусе заказов</p>
                </td>
                <td>
                    <p>Имя, номер телефона, адрес эл. почты</p>
                </td>
                <td>
                    <p>общие</p>
                </td>
                <td>
                    <p>до отзыва согласия на получение информации или удаления профиля</p>
                </td>
                <td>
                    <p>удаление из нашей базы данных</p>
                </td>
            </tr>
        </tbody>
    </table>
</div>
<h1>Как отозвать согласие на персональные данные</h1>
<p>Вы можете в любое время отозвать согласие на обработку персональных данных.</p>
<p>Для этого вы можете написать нам на электронную почту или удалить свои данные путем удаления Профиля.</p>
<p>После отзыва согласия на обработку персональных данных мы не вправе обрабатывать ваши персональные данные в Маркетплейсе.</p>
<h1>Передаем ли мы ваши персональные данные третьим лицам</h1>
<p>Мы не передаем ваши персональные данные третьим лицам без вашего согласия, за исключением случаев, когда такая обязанность установлена для нас законом.</p>
<h1>Как мы обеспечиваем безопасность персональных данных</h1>
<p>Мы защищаем персональные данные, которые у нас хранятся, от разглашения, полной или частичной утраты, а также несанкционированного доступа со стороны третьих лиц.</p>
<p>Для этого мы применяем все необходимые по закону технические и организационные меры по обеспечению безопасности и конфиденциальности, и постоянно обновляем их с учетом последних технических разработок.</p>
<p>Если происходит утечка персональных данных, то мы:</p>
<ul>
    <li>
        <p>в течение 24 часов уведомляем об этом Роскомнадзор,</p>
    </li>
    <li>
        <p>в течение 72 часов проводим собственное расследование и уведомляем Роскомнадзор о его результатах.</p>
    </li>
</ul>
<h1>Что мы не проверяем</h1>
<p>Мы не можем проверить и поэтому доверяем Вам в том, что вы:</p>
<ul>
    <li>
        <p>обладаете полной дееспособностью,</p>
    </li>
    <li>
        <p>предоставили собственные достоверные персональные данные.</p>
    </li>
</ul>
<h1>Как с нами связаться</h1>
<p>По любым вопросам в отношении обработки персональных данных вы можете обратиться к нам по электронной почте&nbsp;<a href="mailto:LUNAmarket@inbox.ru">LUNAmarket@inbox.ru</a>.</p>
<p>При обращении укажите свое имя и контакты для обратной связи.</p>
<p>Мы ответим на ваше обращение не позднее 10 рабочих дней с момента его получения.</p>
<p><br></p>
""";

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: Colors.black,
        title: const Text(
          'Политика конфиденциальности',
          style: TextStyle(fontSize: 14),
        ),
        centerTitle: true,
      ),
      body: SingleChildScrollView(
        child: Html(
          data: htmlData,
        ),
      ),
    );
  }
}
